experiments/results/thesis/DPFS-NULL-T2/MT_8/fio_randread_64k_2_1_2.out
"randread_64k_2_1": (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=io_uring, iodepth=2
fio-3.28
Starting 1 thread

"randread_64k_2_1": (groupid=0, jobs=1): err= 0: pid=25811: Fri Aug 11 08:57:18 2023
  read: IOPS=14.5k, BW=908MiB/s (952MB/s)(53.2GiB/60001msec)
    slat (nsec): min=4182, max=39028, avg=6005.98, stdev=865.61
    clat (usec): min=76, max=733, avg=130.42, stdev=22.52
     lat (usec): min=104, max=740, avg=136.58, stdev=22.51
    clat percentiles (usec):
     |  1.00th=[  115],  5.00th=[  119], 10.00th=[  122], 20.00th=[  124],
     | 30.00th=[  126], 40.00th=[  128], 50.00th=[  129], 60.00th=[  130],
     | 70.00th=[  133], 80.00th=[  135], 90.00th=[  139], 95.00th=[  141],
     | 99.00th=[  155], 99.50th=[  258], 99.90th=[  453], 99.95th=[  461],
     | 99.99th=[  478]
   bw (  KiB/s): min=848000, max=935552, per=100.00%, avg=930198.55, stdev=7808.17, samples=120
   iops        : min=13250, max=14618, avg=14534.37, stdev=122.00, samples=120
  lat (usec)   : 100=0.01%, 250=99.49%, 500=0.51%, 750=0.01%
  cpu          : usr=4.06%, sys=12.24%, ctx=872347, majf=0, minf=0
  IO depths    : 1=0.0%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=872009,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=908MiB/s (952MB/s), 908MiB/s-908MiB/s (952MB/s-952MB/s), io=53.2GiB (57.1GB), run=60001-60001msec